In [10]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

createdb: error: database creation failed: ERROR:  database "pagila_star" already exists
 set_config
------------

(1 row)

psql:Data/pagila-star.sql:29: ERROR:  type "mpaa_rating" already exists
psql:Data/pagila-star.sql:39: ERROR:  type "year" already exists
psql:Data/pagila-star.sql:56: ERROR:  function "_group_concat" already exists with same argument types
psql:Data/pagila-star.sql:73: ERROR:  function "film_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:90: ERROR:  function "film_not_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:135: ERROR:  function "get_customer_balance" already exists with same argument types
psql:Data/pagila-star.sql:157: ERROR:  function "inventory_held_by_customer" already exists with same argument types
psql:Data/pagila-star.sql:194: ERROR:  function "inventory_in_stock" already exists with same argument types
psql:Data/pagila-star.sql:212: ERROR:  function "last_day" already exists with same argument types
psql:Data/pagila-star.sql:227: ERROR:  function "last_updated" already exists with same argument types
psql:Data/pagila-star.sql:251: ERROR:  relation "customer" already exists
psql:Data/pagila-star.sql:315: ERROR:  function "rewards_report" already exists with same argument types
psql:Data/pagila-star.sql:327: ERROR:  function "group_concat" already exists with same argument types
psql:Data/pagila-star.sql:341: ERROR:  relation "actor_actor_id_seq" already exists
psql:Data/pagila-star.sql:355: ERROR:  relation "actor" already exists
psql:Data/pagila-star.sql:369: ERROR:  relation "category_category_id_seq" already exists
psql:Data/pagila-star.sql:382: ERROR:  relation "category" already exists
psql:Data/pagila-star.sql:396: ERROR:  relation "film_film_id_seq" already exists
psql:Data/pagila-star.sql:420: ERROR:  relation "film" already exists
psql:Data/pagila-star.sql:433: ERROR:  relation "film_actor" already exists
psql:Data/pagila-star.sql:446: ERROR:  relation "film_category" already exists
psql:Data/pagila-star.sql:469: ERROR:  relation "actor_info" already exists
psql:Data/pagila-star.sql:483: ERROR:  relation "address_address_id_seq" already exists
psql:Data/pagila-star.sql:501: ERROR:  relation "address" already exists
psql:Data/pagila-star.sql:515: ERROR:  relation "city_city_id_seq" already exists
psql:Data/pagila-star.sql:529: ERROR:  relation "city" already exists
psql:Data/pagila-star.sql:543: ERROR:  relation "country_country_id_seq" already exists
psql:Data/pagila-star.sql:556: ERROR:  relation "country" already exists
psql:Data/pagila-star.sql:570: ERROR:  relation "customer_customer_id_seq" already exists
psql:Data/pagila-star.sql:585: ERROR:  relation "customer_customer_id_seq1" already exists
psql:Data/pagila-star.sql:617: ERROR:  relation "customer_list" already exists
psql:Data/pagila-star.sql:640: ERROR:  relation "film_list" already exists
psql:Data/pagila-star.sql:654: ERROR:  relation "inventory_inventory_id_seq" already exists
psql:Data/pagila-star.sql:668: ERROR:  relation "inventory" already exists
psql:Data/pagila-star.sql:682: ERROR:  relation "language_language_id_seq" already exists
psql:Data/pagila-star.sql:695: ERROR:  relation "language" already exists
psql:Data/pagila-star.sql:718: ERROR:  relation "nicer_but_slower_film_list" already exists
psql:Data/pagila-star.sql:732: ERROR:  relation "payment_payment_id_seq" already exists
psql:Data/pagila-star.sql:748: ERROR:  relation "payment" already exists
psql:Data/pagila-star.sql:762: ERROR:  relation "rental_rental_id_seq" already exists
psql:Data/pagila-star.sql:779: ERROR:  relation "rental" already exists
psql:Data/pagila-star.sql:798: ERROR:  relation "sales_by_film_category" already exists
psql:Data/pagila-star.sql:812: ERROR:  relation "staff_staff_id_seq" already exists
psql:Data/pagila-star.sql:833: ERROR:  relation "staff" already exists
psql:Data/pagila-star.sql:847: ERROR:  relation "store_store_id_seq" already exists
psql:Data/pagila-star.sql:861: ERROR:  relation "store" already exists
psql:Data/pagila-star.sql:883: ERROR:  relation "sales_by_store" already exists
psql:Data/pagila-star.sql:904: ERROR:  relation "staff_list" already exists
psql:Data/pagila-star.sql:1121: ERROR:  duplicate key value violates unique constraint "actor_pkey"
DETAIL:  Key (actor_id)=(1) already exists.
CONTEXT:  COPY actor, line 1
psql:Data/pagila-star.sql:1732: ERROR:  duplicate key value violates unique constraint "address_pkey"
DETAIL:  Key (address_id)=(1) already exists.
CONTEXT:  COPY address, line 1
psql:Data/pagila-star.sql:1756: ERROR:  duplicate key value violates unique constraint "category_pkey"
DETAIL:  Key (category_id)=(1) already exists.
CONTEXT:  COPY category, line 1
psql:Data/pagila-star.sql:2364: ERROR:  duplicate key value violates unique constraint "city_pkey"
DETAIL:  Key (city_id)=(1) already exists.
CONTEXT:  COPY city, line 1
psql:Data/pagila-star.sql:2481: ERROR:  duplicate key value violates unique constraint "country_pkey"
DETAIL:  Key (country_id)=(1) already exists.
CONTEXT:  COPY country, line 1
psql:Data/pagila-star.sql:3088: ERROR:  duplicate key value violates unique constraint "customer_pkey"
DETAIL:  Key (customer_id)=(1) already exists.
CONTEXT:  COPY customer, line 1
psql:Data/pagila-star.sql:4096: ERROR:  duplicate key value violates unique constraint "film_pkey"
DETAIL:  Key (film_id)=(1) already exists.
CONTEXT:  COPY film, line 1: "1	ACADEMY DINOSAUR	A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The C..."
psql:Data/pagila-star.sql:9566: ERROR:  duplicate key value violates unique constraint "film_actor_pkey"
DETAIL:  Key (actor_id, film_id)=(1, 1) already exists.
CONTEXT:  COPY film_actor, line 1
psql:Data/pagila-star.sql:10574: ERROR:  duplicate key value violates unique constraint "film_category_pkey"
DETAIL:  Key (film_id, category_id)=(1, 6) already exists.
CONTEXT:  COPY film_category, line 1
psql:Data/pagila-star.sql:15163: ERROR:  duplicate key value violates unique constraint "inventory_pkey"
DETAIL:  Key (inventory_id)=(1) already exists.
CONTEXT:  COPY inventory, line 1
psql:Data/pagila-star.sql:15177: ERROR:  duplicate key value violates unique constraint "language_pkey"
DETAIL:  Key (language_id)=(1) already exists.
CONTEXT:  COPY language, line 1
psql:Data/pagila-star.sql:63335: ERROR:  duplicate key value violates unique constraint "rental_pkey"
DETAIL:  Key (rental_id)=(2) already exists.
CONTEXT:  COPY rental, line 1
psql:Data/pagila-star.sql:63345: ERROR:  duplicate key value violates unique constraint "staff_pkey"
DETAIL:  Key (staff_id)=(1) already exists.
CONTEXT:  COPY staff, line 1
psql:Data/pagila-star.sql:63355: ERROR:  duplicate key value violates unique constraint "store_pkey"
DETAIL:  Key (store_id)=(1) already exists.
CONTEXT:  COPY store, line 1
 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

psql:Data/pagila-star.sql:63461: ERROR:  multiple primary keys for table "actor" are not allowed
psql:Data/pagila-star.sql:63469: ERROR:  multiple primary keys for table "address" are not allowed
psql:Data/pagila-star.sql:63477: ERROR:  multiple primary keys for table "category" are not allowed
psql:Data/pagila-star.sql:63485: ERROR:  multiple primary keys for table "city" are not allowed
psql:Data/pagila-star.sql:63493: ERROR:  multiple primary keys for table "country" are not allowed
psql:Data/pagila-star.sql:63501: ERROR:  multiple primary keys for table "customer" are not allowed
psql:Data/pagila-star.sql:63509: ERROR:  multiple primary keys for table "film_actor" are not allowed
psql:Data/pagila-star.sql:63517: ERROR:  multiple primary keys for table "film_category" are not allowed
psql:Data/pagila-star.sql:63525: ERROR:  multiple primary keys for table "film" are not allowed
psql:Data/pagila-star.sql:63533: ERROR:  multiple primary keys for table "inventory" are not allowed
psql:Data/pagila-star.sql:63541: ERROR:  multiple primary keys for table "language" are not allowed
psql:Data/pagila-star.sql:63549: ERROR:  multiple primary keys for table "rental" are not allowed
psql:Data/pagila-star.sql:63557: ERROR:  multiple primary keys for table "staff" are not allowed
psql:Data/pagila-star.sql:63565: ERROR:  multiple primary keys for table "store" are not allowed
psql:Data/pagila-star.sql:63572: ERROR:  relation "film_fulltext_idx" already exists
psql:Data/pagila-star.sql:63579: ERROR:  relation "idx_actor_last_name" already exists
psql:Data/pagila-star.sql:63586: ERROR:  relation "idx_fk_address_id" already exists
psql:Data/pagila-star.sql:63593: ERROR:  relation "idx_fk_city_id" already exists
psql:Data/pagila-star.sql:63600: ERROR:  relation "idx_fk_country_id" already exists
psql:Data/pagila-star.sql:63607: ERROR:  relation "idx_fk_customer_id" already exists
psql:Data/pagila-star.sql:63614: ERROR:  relation "idx_fk_film_id" already exists
psql:Data/pagila-star.sql:63621: ERROR:  relation "idx_fk_inventory_id" already exists
psql:Data/pagila-star.sql:63628: ERROR:  relation "idx_fk_language_id" already exists
psql:Data/pagila-star.sql:63635: ERROR:  relation "idx_fk_original_language_id" already exists
psql:Data/pagila-star.sql:63642: ERROR:  relation "idx_fk_payment_customer_id" already exists
psql:Data/pagila-star.sql:63649: ERROR:  relation "idx_fk_payment_staff_id" already exists
psql:Data/pagila-star.sql:63656: ERROR:  relation "idx_fk_store_id" already exists
psql:Data/pagila-star.sql:63663: ERROR:  relation "idx_last_name" already exists
psql:Data/pagila-star.sql:63670: ERROR:  relation "idx_store_id_film_id" already exists
psql:Data/pagila-star.sql:63677: ERROR:  relation "idx_title" already exists
psql:Data/pagila-star.sql:63684: ERROR:  relation "idx_unq_manager_staff_id" already exists
psql:Data/pagila-star.sql:63691: ERROR:  relation "idx_unq_rental_rental_date_inventory_id_customer_id" already exists
psql:Data/pagila-star.sql:63698: ERROR:  trigger "film_fulltext_trigger" for relation "film" already exists
psql:Data/pagila-star.sql:63705: ERROR:  trigger "last_updated" for relation "actor" already exists
psql:Data/pagila-star.sql:63712: ERROR:  trigger "last_updated" for relation "address" already exists
psql:Data/pagila-star.sql:63719: ERROR:  trigger "last_updated" for relation "category" already exists
psql:Data/pagila-star.sql:63726: ERROR:  trigger "last_updated" for relation "city" already exists
psql:Data/pagila-star.sql:63733: ERROR:  trigger "last_updated" for relation "country" already exists
psql:Data/pagila-star.sql:63740: ERROR:  trigger "last_updated" for relation "customer" already exists
psql:Data/pagila-star.sql:63747: ERROR:  trigger "last_updated" for relation "film" already exists
psql:Data/pagila-star.sql:63754: ERROR:  trigger "last_updated" for relation "film_actor" already exists
psql:Data/pagila-star.sql:63761: ERROR:  trigger "last_updated" for relation "film_category" already exists
psql:Data/pagila-star.sql:63768: ERROR:  trigger "last_updated" for relation "inventory" already exists
psql:Data/pagila-star.sql:63775: ERROR:  trigger "last_updated" for relation "language" already exists
psql:Data/pagila-star.sql:63782: ERROR:  trigger "last_updated" for relation "rental" already exists
psql:Data/pagila-star.sql:63789: ERROR:  trigger "last_updated" for relation "staff" already exists
psql:Data/pagila-star.sql:63796: ERROR:  trigger "last_updated" for relation "store" already exists
psql:Data/pagila-star.sql:63804: ERROR:  constraint "address_city_id_fkey" for relation "address" already exists
psql:Data/pagila-star.sql:63812: ERROR:  constraint "city_country_id_fkey" for relation "city" already exists
psql:Data/pagila-star.sql:63820: ERROR:  constraint "customer_address_id_fkey" for relation "customer" already exists
psql:Data/pagila-star.sql:63828: ERROR:  constraint "customer_store_id_fkey" for relation "customer" already exists
psql:Data/pagila-star.sql:63836: ERROR:  constraint "film_actor_actor_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-star.sql:63844: ERROR:  constraint "film_actor_film_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-star.sql:63852: ERROR:  constraint "film_category_category_id_fkey" for relation "film_category" already exists
psql:Data/pagila-star.sql:63860: ERROR:  constraint "film_category_film_id_fkey" for relation "film_category" already exists
psql:Data/pagila-star.sql:63868: ERROR:  constraint "film_language_id_fkey" for relation "film" already exists
psql:Data/pagila-star.sql:63876: ERROR:  constraint "film_original_language_id_fkey" for relation "film" already exists
psql:Data/pagila-star.sql:63884: ERROR:  constraint "inventory_film_id_fkey" for relation "inventory" already exists
psql:Data/pagila-star.sql:63892: ERROR:  constraint "inventory_store_id_fkey" for relation "inventory" already exists
psql:Data/pagila-star.sql:63900: ERROR:  constraint "payment_customer_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:63908: ERROR:  constraint "payment_rental_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:63916: ERROR:  constraint "payment_staff_id_fkey" for relation "payment" already exists
psql:Data/pagila-star.sql:63924: ERROR:  constraint "rental_customer_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:63932: ERROR:  constraint "rental_inventory_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:63940: ERROR:  constraint "rental_staff_id_fkey" for relation "rental" already exists
psql:Data/pagila-star.sql:63948: ERROR:  constraint "staff_address_id_fkey" for relation "staff" already exists
psql:Data/pagila-star.sql:63956: ERROR:  constraint "staff_store_id_fkey" for relation "staff" already exists
psql:Data/pagila-star.sql:63964: ERROR:  constraint "store_address_id_fkey" for relation "store" already exists

In [11]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

## Create Cube

In [19]:
%%time
%%sql

SELECT dimdate.day, dimmovie.rating, dimcustomer.city, sum(sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimmovie ON dimmovie.movie_key = factsales.movie_key
JOIN dimcustomer ON dimcustomer.customer_key = factsales.customer_key
GROUP BY dimDate.day, dimMovie.rating, dimCustomer.city
ORDER BY revenue DESC
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 4.86 ms, sys: 1.79 ms, total: 6.65 ms
Wall time: 75 ms

[(30, 'G', 'San Bernardino', Decimal('49.94')),
 (30, 'NC-17', 'Apeldoorn', Decimal('47.90')),
 (21, 'NC-17', 'Belm', Decimal('45.94')),
 (28, 'R', 'Mwanza', Decimal('43.94')),
 (30, 'PG-13', 'Zanzibar', Decimal('43.94')),
 (21, 'G', 'Citt del Vaticano', Decimal('43.94')),
 (22, 'R', 'Yangor', Decimal('39.94')),
 (28, 'PG-13', 'Dhaka', Decimal('39.94')),
 (17, 'G', 'Rajkot', Decimal('39.94')),
 (1, 'R', 'Qomsheh', Decimal('39.94'))]

## Slicing

In [20]:
%%time
%%sql

SELECT dimdate.day, dimmovie.rating, dimcustomer.city, sum(sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimmovie ON dimmovie.movie_key = factsales.movie_key
JOIN dimcustomer ON dimcustomer.customer_key = factsales.customer_key
WHERE dimMovie.rating = 'PG-13'
GROUP BY (dimDate.day, dimMovie.rating, dimCustomer.city)
ORDER BY revenue DESC
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 4.38 ms, sys: 2.11 ms, total: 6.49 ms
Wall time: 28.1 ms

[(30, 'PG-13', 'Zanzibar', Decimal('43.94')),
 (28, 'PG-13', 'Dhaka', Decimal('39.94')),
 (29, 'PG-13', 'Shimoga', Decimal('37.94')),
 (30, 'PG-13', 'Osmaniye', Decimal('37.94')),
 (21, 'PG-13', 'Asuncin', Decimal('37.90')),
 (20, 'PG-13', 'Baha Blanca', Decimal('35.96')),
 (21, 'PG-13', 'Parbhani', Decimal('35.96')),
 (30, 'PG-13', 'Nagareyama', Decimal('35.96')),
 (30, 'PG-13', 'Tanauan', Decimal('35.92')),
 (17, 'PG-13', 'Ikerre', Decimal('35.90'))]

## Dicing

In [26]:
%%time
%%sql

SELECT dimdate.day, dimmovie.rating, dimcustomer.city, sum(sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimmovie ON dimmovie.movie_key = factsales.movie_key
JOIN dimcustomer ON dimcustomer.customer_key = factsales.customer_key
WHERE dimMovie.rating in ('PG-13', 'PG')
AND dimCustomer.city in ('Bellevue', 'Lancaster')
AND dimDate.day in ('1', '15', '30')
GROUP BY (dimDate.day, dimMovie.rating, dimCustomer.city)
ORDER BY revenue DESC
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
6 rows affected.
CPU times: user 4.6 ms, sys: 2.66 ms, total: 7.27 ms
Wall time: 15.7 ms

[(30, 'PG', 'Lancaster', Decimal('25.96')),
 (1, 'PG-13', 'Lancaster', Decimal('11.98')),
 (30, 'PG-13', 'Bellevue', Decimal('7.98')),
 (30, 'PG-13', 'Lancaster', Decimal('5.98')),
 (15, 'PG-13', 'Bellevue', Decimal('3.96')),
 (1, 'PG', 'Bellevue', Decimal('1.98'))]

## Roll-up

In [30]:
%%time
%%sql
SELECT dimdate.day, dimmovie.rating, dimcustomer.country, SUM(sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimmovie ON dimmovie.movie_key = factsales.movie_key
JOIN dimcustomer ON dimcustomer.customer_key = factsales.customer_key
GROUP BY (dimDate.day, dimMovie.rating, dimCustomer.country)
ORDER BY revenue DESC
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 3.24 ms, sys: 1.34 ms, total: 4.58 ms
Wall time: 83.7 ms

[(30, 'G', 'China', Decimal('339.34')),
 (30, 'PG', 'India', Decimal('313.34')),
 (30, 'NC-17', 'India', Decimal('307.28')),
 (30, 'PG-13', 'China', Decimal('293.34')),
 (30, 'R', 'China', Decimal('291.32')),
 (30, 'R', 'India', Decimal('287.36')),
 (30, 'G', 'India', Decimal('275.34')),
 (18, 'NC-17', 'India', Decimal('271.50')),
 (30, 'PG', 'China', Decimal('263.44')),
 (21, 'PG-13', 'India', Decimal('257.48'))]

## Drill-down

In [32]:
%%time
%%sql
SELECT dimdate.day, dimmovie.rating, dimcustomer.district, SUM(sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimmovie ON dimmovie.movie_key = factsales.movie_key
JOIN dimcustomer ON dimcustomer.customer_key = factsales.customer_key
GROUP BY (dimDate.day, dimMovie.rating, dimCustomer.district)
ORDER BY revenue DESC
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 4.16 ms, sys: 1.74 ms, total: 5.91 ms
Wall time: 88.4 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('107.76')),
 (30, 'G', 'Inner Mongolia', Decimal('77.86')),
 (30, 'G', 'Shandong', Decimal('73.86')),
 (30, 'NC-17', 'West Bengali', Decimal('73.84')),
 (17, 'PG-13', 'Shandong', Decimal('69.90')),
 (1, 'PG', 'California', Decimal('65.88')),
 (18, 'NC-17', 'So Paulo', Decimal('65.86')),
 (21, 'R', 'So Paulo', Decimal('63.86')),
 (30, 'NC-17', 'Buenos Aires', Decimal('63.86')),
 (30, 'PG', 'Southern Tagalog', Decimal('61.88'))]

## Grouping Sets

In [33]:
%%sql
SELECT SUM(sales_amount)
FROM factsales;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
1 rows affected.

[(Decimal('134833.02'),)]

In [36]:
%%sql
SELECT dimdate.month, SUM(factsales.sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
GROUP BY dimdate.month
ORDER BY revenue DESC
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.

[(4, Decimal('57118.92')),
 (3, Decimal('47773.12')),
 (2, Decimal('19263.76')),
 (1, Decimal('9648.86')),
 (5, Decimal('1028.36'))]

In [44]:
%%sql
SELECT dimdate.month, dimstore.country, SUM(factsales.sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimstore ON dimstore.store_key = factsales.store_key
GROUP BY (dimdate.month, dimstore.country)
ORDER BY dimdate.month, dimstore.country, revenue DESC

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20'))]

In [48]:
%%time
%%sql
SELECT dimdate.month, dimstore.country, SUM(factsales.sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimstore ON dimstore.store_key = factsales.store_key
GROUP by grouping sets ((), dimDate.month,  dimStore.country, (dimDate.month,  dimStore.country));

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.
CPU times: user 3.02 ms, sys: 1.37 ms, total: 4.39 ms
Wall time: 32.5 ms

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (1, None, Decimal('9648.86')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (2, None, Decimal('19263.76')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (3, None, Decimal('47773.12')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (4, None, Decimal('57118.92')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20')),
 (5, None, Decimal('1028.36')),
 (None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54'))]

## CUBE

In [49]:
%%time
%%sql
SELECT dimdate.month, dimstore.country, SUM(factsales.sales_amount) AS revenue
FROM factsales
JOIN dimdate ON dimdate.date_key = factsales.date_key
JOIN dimstore ON dimstore.store_key = factsales.store_key
GROUP BY cube (dimDate.month,  dimStore.country)

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.
CPU times: user 2.81 ms, sys: 1.18 ms, total: 3.99 ms
Wall time: 32.5 ms

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (1, None, Decimal('9648.86')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (2, None, Decimal('19263.76')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (3, None, Decimal('47773.12')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (4, None, Decimal('57118.92')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20')),
 (5, None, Decimal('1028.36')),
 (None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54'))]

In [50]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
18 rows affected.
CPU times: user 4.9 ms, sys: 1.54 ms, total: 6.44 ms
Wall time: 61.7 ms

[(None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54')),
 ('3', None, Decimal('47773.12')),
 ('5', None, Decimal('1028.36')),
 ('4', None, Decimal('57118.92')),
 ('2', None, Decimal('19263.76')),
 ('1', None, Decimal('9648.86')),
 ('1', 'Australia', Decimal('4728.38')),
 ('1', 'Canada', Decimal('4920.48')),
 ('2', 'Australia', Decimal('9790.20')),
 ('2', 'Canada', Decimal('9473.56')),
 ('3', 'Australia', Decimal('24120.66')),
 ('3', 'Canada', Decimal('23652.46')),
 ('4', 'Australia', Decimal('28272.14')),
 ('4', 'Canada', Decimal('28846.78')),
 ('5', 'Australia', Decimal('542.16')),
 ('5', 'Canada', Decimal('486.20'))]